const name = 'Генератор защитного поля';
let price = 1000;

const firstName =
  'Выбран «Генератор защитного поля», цена за штуку 1000 кредитов';
console.log(firstName);
console.log(price);

price = 2000;

const secondName =
  'Выбран «Генератор защитного поля», цена за штуку 2000 кредитов';
console.log(secondName);
console.log(price);

// Объяви две переменные хранящие название и цену товара name и price.

// Присвой переменным следующие характеристики товара (сразу при объявлении)

// название: «Генератор защитного поля»
// цена: 1000
// Используя шаблонную строку и переменные name и price задай новой переменной firstMessage текст:

// Выбран «Генератор защитного поля», цена за штуку 1000 кредитов
// Присвой товару (price) новую цену - 2000

// Используя шаблонную строку и переменные name и price задай новой переменной secondMessage текст:

// Выбран «Генератор защитного поля», цена за штуку 2000 кредитов
